Revit 2027 API
BuiltInFailures.AssemblyFailures.DeleteShopDrawingsWarn Property
 The assembly instance has associated views and cannot be merged with assembly type '%1!s!'. Delete the views to continue.\n\nViews:%2!s!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeleteShopDrawingsWarn { get; }
Public Shared ReadOnly Property DeleteShopDrawingsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeleteShopDrawingsWarn {
	FailureDefinitionId^ get ();
}
static member DeleteShopDrawingsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace